---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.SeparationNotAtJunction
source: html/ffe123f8-618c-7d57-40fd-cb9ab5707679.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.SeparationNotAtJunction Property

This hydraulic loop is not separated at any junction. Use the Remove Separation tool to clean up undesired hydraulic separations.

## Syntax (C#)
```csharp
public static FailureDefinitionId SeparationNotAtJunction { get; }
```